from flask import Flask

# Створимо змінну app, яка буде екземпляром класу Flask :
app = Flask(__name__)
     #    де __name__ - це системна змінна, яка вказує на назву головного модуля.
     #       Це - як точка входу в програму.
     #       Саме ця змінна app стає головним контролером нашого веб-додатку,
     #       тобто буде приймати і обробляти всі запити від користувачів.
     #   Далі запити від клієнтів  поступають на різні адреси (URL).
     #   Тобто є накшталт endpoint-ів або маршрутів.
     #   Маршрути ми створюємо за допомогою декоратора @app.route,
     #   який вказує, за якою адресою (URL) буде доступна та чи інша сторінка.
     #   Контролер на сайті знає, де лежать сторінки, а на вхід для виконання певної 
     #   функції контролера  ви маєте звернутись до нього (до цього сайту) з певною адресою.
     #   Декоратор @app.route приймає в якості аргументу адресу (URL), за якою
     #   буде доступна певна функція контролера :
     #   ми могли би написати @app.route('/') - і тоді б мала відкриватись домашня сторінка,
     #   ми могли би написати @app.route('/about') - і тоді б відкривалась сторінка про сайт,
     #   ми могли би написати @app.route('/contacts') - і тоді б відкривалась сторінка з контактами.
     #   - Це є маршрутизація (endpoint). - Ми просто пишемо ту адресу, за якою хочемо 
     #   отримати від сервера якусь сторінку і у себе в браузері на неї подивитись.
     #   В нашому випадку ми вкажемо '/', тобто кореневу дефолтну сторінку, дефолтну адресу.
     #   Тобто ми просто заходимо на сайт, не вказуючи ніяких додаткових адрес :
@app.route('/')


  #  Далі ми створюємо функцію контролера, яка буде виконуватись, коли користувач 
  #  зайде на цю адресу. В python-і функції створюються за допомогою ключового слова def :
def hellow():
    return '<h1 style="color: red">Привіт, світе! Я працюю з Flask та Docker!</h1>'


  #   Створюємо точку входу в програму :
if __name__ == '__main__':
    app.run(host='0.0.0.0', port=80)
        #  Це ми в методі run додали іменований аргумент host і записали в нього 0.0.0.0
        #  Тобто host - довільний, щоб сам сервер знав, що він може бути запущений будь-де.
        #  А потр ми запислаи 80, щоб не вказувати порт явно в браузері.
        #  Порт 80 - це універсальний дефолтний порт для http-запитів.
        #  І більшість Linux-серверів працюють саме на 80-му порту.
        #  Порт 80 вважається загальнодоступним, от тільки треба щоб він 
        #  на сервері не був зайнятий якоюсь іншою програмою.
 